app/views/static_pages/_user.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 60], ["LIMIT", 1]]
---
  <% Tweet.where(:tweet_id => t.tweet_id).each do |c| %>
  <% User.where(:id => c.user_id).each do |u| %>