app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "red panthers"], ["created_at", 2016-12-06 07:22:09 UTC], ["updated_at", 2016-12-06 07:22:09 UTC]]
SELECT MAX("companies"."id") FROM "companies"
UPDATE "users" SET "updated_at" = ?, "user_email" = ? WHERE "users"."id" = ?  [["updated_at", 2016-12-07 05:13:14 UTC], ["user_email", "#<ActionController::Parameters:0x007febba6ab258>"], ["id", 11]]
---
  def create
      @company = Company.new(company_params)
      @company.save
      @user = current_user
      last_id = Company.maximum('id')
      @user.update(company_id: last_id)