app/controllers/omniauth_callbacks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["uid", "3699463212"], ["LIMIT", 1]]
---
 def twitter

    auth = env["omniauth.auth"]
    hash = session[:hash_id]
    @user = User.find_for_twitter_oauth(request.env["omniauth.auth"],current_user, hash)