app/controllers/static_pages_controller.rb

  def index
    if user_signed_in?
      @user = User.all
      @new_tweets = Tweet.where(:user_id => current_user.id).reverse
---
SELECT "users".* FROM "users"
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 5]]