app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "message", "created_at", "updated_at", "autoretweet") VALUES (?, ?, ?, ?, ?)  [["user_id", 32], ["message", "adsdff"], ["created_at", 2016-12-16 06:01:12 UTC], ["updated_at", 2016-12-16 06:01:12 UTC], ["autoretweet", "1"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def create
      check = params[:autoretweet]
      if check.nil?
  	    @tweet = Tweet.new(twitter_params)
  	    @tweet.user_id = current_user.id
  	    @tweet.save
      else
        @tweet = Tweet.new(twitter_params)
        @tweet.user_id = current_user.id
        @tweet.save
        msg = Tweet.maximum('message')
        @role = User.where(:company_id => current_user.company_id, :role => "user")
        @role.each do |t|