app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "name", "created_at", "updated_at", "invitation_token", "invitation_created_at", "invitation_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT MAX("users"."id") FROM "users"
---
 def create
  @new_user = User.new(:email => email_params[:email], :company_id => email_params[:company_id], :role => email_params[:role], :password => "123456789")
  if @new_user.save
    @user_id = User.maximum('id')